rails-server/app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "bingsteup@gmail.com"]]
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["auth_token", "testtest"], ["updated_at", "2016-04-03 09:13:27.661610"], ["id", 1]]
---
      def create
        user = User.find_by_email!(params[:email])
        if user.valid_password?(params[:password])
          user.generate_auth_token
          user.save